{
  "experience": [
    {
      "company": "Critical Tech Works",
      "job": "Senior Software Engineer",
      "date": "Sep 2022 - Present",
      "description": "Worked at CTW, a BMW Group software company, on the Retail Integration Service. Developed REST and streaming interfaces to connect BMW services with dealers worldwide. As part of a Scrum team of 12 developers, played a key role in strategic planning and execution. Spearheaded the migration of services from Azure to AWS, configuring Kubernetes clusters with Grafana and OpenTelemetry for seamless transition of over 20 services. Laid the groundwork for migrating from Payara to Quarkus, which streamlined development and operations. Fostered a culture of documentation and transparency by creating wikis and communication channels for clients and developers. Enhanced system performance and reliability, facilitated better resource management, and provided a scalable infrastructure for future growth. Improved CTW's reputation for delivering robust and innovative solutions within the BMW Group by releasing the services 20% earlier than expected."
    },
    {
      "company": "DieselBank",
      "job": "Senior Software Engineer",
      "date": "Jan 2022 - Mar 2023",
      "description": "Worked as a Senior Software Engineer on a team of 5 at DieselBank, a financial institution providing bank solutions and quality of life services to truck drivers across Brazil. Developed new features for mobile and backend applications, designed a new backend structure, optimized the infrastructure on AWS. Made their mobile app scalable and reliable by using Flutter, Redux and Firebase. Designed a new backend structure centered around hexagonal architecture and monorepo using GraphQL, Kotlin, and SQL. Used Gradle for the backend and Lerna for the frontend to support quicker technology changes, more robust pipelines, and easier code sharing. Automated deployment, documentation, and testing on GitHub Actions using Docker. Created scalable solutions on AWS using ECS, Load Balancers, Kafka, RDS, Prometheus, and Grafana. Reduced infrastructure costs while increasing our ability to accommodate more users and making debugging easier. Implemented onboarding proof-of-liveness features that reduced fraud from 100 cases per month to zero, enhancing our security and user experience. Created a development cycle and pipeline that made the app release with 98% less bugs than it was used to, according to crashlytics."
    },
    {
      "company": "KIS Solutions",
      "job": "Software Engineer (Remote)",
      "date": "Nov 2018 - Dec 2021",
      "description": "Worked as a Software Engineer at K.I.S. solutions, offering solutions to big businesses like Staples and Estee Lauder and for startup projects.For startup projects as an angular frontend developer, for Staples as a Java/Angular fullstack developer for 3 of their projects, but mostly on Estee Lauder as a fullstack engineer, working with data processing with Spark, Angular frontend, iOS nativescript frontend and Java microservices. With fast and reliable releases, clients renewed contracts resulting in higher projects intake. Delivered a Estee Lauder iOS application that was used in its stores in Mexico, Chile, Argentina and Brazil. Automated data processing for their thousands of tables, reducing 1 to 2 hours of development per table to about 10 seconds. Delivered about 300MB of data per day using Spark, for post data analysis."
    },
    {
      "company": "Curtir Sua Cidade",
      "job": "Tech Lead /Software Engineer",
      "date": "Aug 2017 - Jan 2019",
      "description": "Worked as a Software Developer and Tech Lead for a team of 3 at Curtir Sua Cidade, a project for a startup which displays close events to the user in an easy manner, with more than 10,000 events listed. Worked on its main website as a core programmer and project manager. Configured the Heroku servers with Mongodb and SendGrid using Docker. Set the development workflow using github, github projects, toptracker and many other technologies,  ported the backend from node to a internal framework made by myself in python, and developed the frontend using AngularJS."
    },
    {
      "company": "Conpec",
      "job": "Software Engineer (Freelancer)",
      "date": "Apr 2015 - Jan 2018",
      "description": "Worked for a variety of web projects using mostly Polymer and Python. Also refactored a Moodle platform to be more accessible."
    },
    {
      "company": "Clube da Entrega",
      "job": "Software Developer",
      "date": "May 2015 - Jul 2016",
      "description": "A project to centralize the delivery of food, give more useful data to restaurants and make everything easier for both the customer and the restaurant. Worked mostly on web frontend and node backend. Examples include their main site."
    },
    {
      "company": "Dot-Insight",
      "job": "Dotnet Developer (Internship)",
      "date": "Apr 2014 - Aug 2014",
      "description": "A consulting service focused on Microsoft tools. Works include web development using ASP.net MVC, Windows Phone apps and Microsoft Dynamics CRM workers."
    }
  ]
} 